# 迴圈計數器
# 1. 初始化計數器 i = 0 (i可以自己取，但通常看到i就會知道你在計數)
# 2. 計數器判斷: i < 10
# 3. 計數器增加: i = i + i
i = 0
while i < 10:
    i = i + 1 # 你要做的程式碼片段

# 1.次數永遠在 < 後面
# 2.你的i永遠是0,1,2...9
# 反正上面那三條沒事不要亂動

# 從0-9
i = 0
while i < 10:
    print(i)
    i = i + 1

# 從1-9
i = 0
while i < 10:
    i = i + 1
    print(i)

# 從10倒數倒1
i = 0
while i < 10:
    print(10 - i)
    i = i + 1

# 印出 1 3 5 7
i = 0
while i < 10:
    print(2 * i + 1)
    i = i + 1

i = 0
while i <10:
    print(i,
          i+5,
          87-5)
    i = i + 1
